Dlubal.TimberPro.IModuleCase2
Interface for working with module case.

Dlubal.TimberPro.IModuleCase2.GetMemberEffectiveLength2(System.Int32,System.UInt32)
Gets member effective length.
Returns: Member effective length parameters.
No: Number or index of the member effective length you want to get.
At: Specifies the type of access.

Dlubal.TimberPro.IModuleCase2.SetMemberEffectiveLength2(System.Int32,System.UInt32,System.UInt32@)
Sets member effective length.
No: Number or index of the members effective length you want to set.
At: Specifies the type of access.
Length: Members effective length parameters

Dlubal.TimberPro.IModuleCase2.GetMembersEffectiveLengths2
Gets members effective lengths.
Returns: Array of all members effective lengths

Dlubal.TimberPro.IModuleCase2.SetMembersEffectiveLengths2(System.UInt32@)
Sets members effective lengths.
Lengths: Array of members effective lengths you want to set.

Dlubal.TimberPro.IModuleCase2.GetSetEffectiveLength2(System.Int32,System.UInt32)
Gets set of members effective length.
Returns: Set of members effective length parameters.
No: Number or index of the set of members effective length you want to get.
At: Specifies the type of access.

Dlubal.TimberPro.IModuleCase2.SetSetEffectiveLength2(System.Int32,System.UInt32,System.UInt32@)
Sets set of members effective length.
No: Number or index of the set of members effective length you want to set.
At: Specifies the type of access.
Length: Set of members effective length parameters

Dlubal.TimberPro.IModuleCase2.GetSetsEffectiveLengths2
Gets sets of members effective lengths.
Returns: Array of all sets of members effective lengths.

Dlubal.TimberPro.IModuleCase2.SetSetsEffectiveLengths2(System.UInt32@)
Sets sets of members effective lengths.
Lengths: Array of sets of members effective lengths.

Dlubal.TimberPro.IModuleCase2.GetOtherOptions2
Gets other options.
Returns: Other options

Dlubal.TimberPro.IModuleCase2.SetOtherOptions2(System.UInt32@)
Sets other options.
Options: Other options